MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO112SC2AN/mcu.h
    /**
     * ISR
     * ===================================================================================================
     * Offset: 0x10  Timer x Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TMR_IS    |Timer Interrupt Status
     * |        |          |This bit indicates the interrupt status of Timer.
     * |        |          |This bit is set by hardware when the up counting value of internal 24-bit counter matches the timer compared value (TMR_CMPR).
     * |        |          |Write 1 to clear this bit to 0.
     * |        |          |If this bit is active and TMR_IE (TMRx_IER[0]) is enabled, Timer will trigger an interrupt to CPU.
     * |[1]     |TCAP_IS   |Timer Capture Function Interrupt Status
     * |        |          |This bit indicates the external pin function interrupt status of Timer.
     * |        |          |This bit is set by hardware when TCAP_EN (TMRx_CTL[16]) is set high, and the transition of external pin matches the TCAP_EDGE (TMRx_CTL[19:18]) setting.
     * |        |          |Write 1 to clear this bit to 0.
     * |        |          |If this bit is active and TCAP_IE (TMRx_IER[1]) is enabled, Timer will trigger an interrupt to CPU.
     * |[4]     |TMR_WAKE_STS|Timer Wake-Up Status
     * |        |          |If timer causes CPU wakes up from power-down mode, this bit will be set to high.
     * |        |          |It must be cleared by software with a write 1 to this bit.
     * |        |          |0 = Timer does not cause system wake-up.
     * |        |          |1 = Wakes system up from power-down mode by Timer timeout.
     * |[5]     |NCAP_DET_STS|New Capture Detected Status
     * |        |          |This status is to indicate there is a new incoming capture event detected before CPU clearing the TCAP_IS (TMRx_ISR[1]) status.
     * |        |          |If the above condition occurred, the Timer will keep register TMRx_TCAP unchanged and drop the new capture value.
     * |        |          |Write 1 to clear this bit to 0.
     * |        |          |0 = New incoming capture event didn't detect before CPU clearing TCAP_IS (TMRx_ISR[1]) status.
     * |        |          |1 = New incoming capture event detected before CPU clearing TCAP_IS (TMRx_ISR[1]) status.
     * |[6]     |TCAP_IS_FEDGE|TC Pin Edge Detect Is Falling
     * |        |          |This flag indicates the edge detected in TC pin is rising edge or falling edge.
     * |        |          |Timer only updates this flag when it updates the Timer Capture Data (TMR_TCAP[23:0]) value.
     * |        |          |When a new incoming capture event detected before CPU clearing the TCAP_IS (TMRx_ISR[1]) status, Timer will keep this bit unchanged.
     * |        |          |0 = TC pin edge detected is rising edge.
     * |        |          |1 = TC pin edge detected is falling edge.
    */
    __IO uint32_t ISR;

    /**
     * DR
     * ===================================================================================================
     * Offset: 0x14  Timer 0 Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |TDR       |Timer Data Register (Read)
     * |        |          |User can read this register for internal 24-bit timer up-counter value.
     * |        |          |Counter Reset (Write)
     * |        |          |User can write any value to this register to reset internal 24-bit timer up-counter and 8-bit pre-scale counter.
     * |        |          |This reset operation wouldn't affect any other timer control registers and circuit.
     * |        |          |After reset completed, the 24-bit timer up-counter and 8-bit pre-scale counter restart the counting based on the TMRx_CTL register setting.
     * |[31]    |RSTACT    |Reset Active
     * |        |          |This bit indicates if the counter reset operation active.
     * |        |          |When user write this register, timer starts to reset its internal 24-bit timer up-counter and 8-bit pre-scale counter to 0.
     * |        |          |In the same time, timer set this flag to 1 to indicate the counter reset operation is in progress.
     * |        |          |Once the counter reset operation done, timer clear this bit to 0 automatically.
     * |        |          |0 = Reset operation done.
     * |        |          |1 = Reset operation triggered by writing TMR_DR is in progress.
     * |        |          |Note: This bit is read only. Write operation wouldn't take any effect.
    */
    __IO uint32_t DR;

    /**
     * TCAP
     * ===================================================================================================
     * Offset: 0x18  Timer x Capture Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |CAP       |Timer Capture Data Register
     * |        |          |When TCAP_EN (TMRx_CTL[16]) is set, TCAP_MODE (TMRx_CTL[17]) is 0, TCAP_CNT_MOD (TMRx_CTL[20]) is 0, and the transition of external pin matches the TCAP_EDGE (TMRx_CTL[19:18]) setting, the value of 24-bit up-counting timer will be saved into register TMRx_TCAP.
     * |        |          |When TCAP_EN (TMRx_CTL[16]) is set, TCAP_MODE (TMRx_CTL[17]) is 0, TCAP_CNT_MOD (TMRx_CTL[20]) is 1, and the transition of external pin matches the 2nd transition of TCAP_EDGE (TMRx_CTL[19:18]) setting, the value of 24-bit up-counting timer will be saved into register TMRx_TCAP.
     * |        |          |User can read this register to get the counter value.
     * |        |          |When a new incoming capture event detected before CPU clearing the TCAP_IS (TMRxISR[1]) status, Timer will keep this filed value unchanged and drop the new capture value.
    */
    __I  uint32_t TCAP;
    uint32_t RESERVE0[1];


    /**
     * ECTL
     * ===================================================================================================
     * Offset: 0x20  Timer x Extended Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EVNT_GEN_EN|Event Generator Function Enable Control
     * |        |          |When this bit is high, timer would generate a high pulse event out when it increases the 24-bit up counter and the polarity of signal defined by EVNT_GEN_SRC (TMRx_ECTL[12]) is same as the polarity defined by EVNT_GEN_POL (TMRx_ECTL[1]).
     * |        |          |0 = Event generator function disabled.
     * |        |          |1 = Event generator function enabled.
     * |[1]     |EVNT_GEN_POL|Event Generator Reference Input Source Polarity Selection
     * |        |          |When this bit is low and EVNT_GEN_EN (TMRx_ECTL[0]) is high, timer would generate a high pulse event out when it increases the 24-bit up counter and the polarity of signal defined by EVNT_GEN_SRC (TMRx_ECTL[12]) is low.
     * |        |          |When this bit is high and EVNT_GEN_EN (TMRx_ECTL[0]) is high, timer would generate a low pulse event pulse out when it increases the 24-bit up counter and the polarity of signal defined by EVNT_GEN_SRC (TMRx_ECTL[12]) is high.
     * |        |          |This bit only affects timer's operation when EVNT_GEN_EN (TMRx_ECTL[0]) is high.
     * |        |          |0 = Timer generates a high pulse event out when it increase the 24-bit up counter and the polarity of signal defined by EVNT_GEN_SRC (TMRx_ECTL[12]) is low.
     * |        |          |1 = Timer generates a high pulse event out when it increase the 24-bit up counter and the polarity of signal defined by EVNT_GEN_SRC (TMRx_ECTL[12]) is high.
     * |[8]     |EVNT_CNT_SRC|Event Counting Source Selection
     * |        |          |This bit defines the TMRx+1 event counting source is from external event pin TMx+1 or internal signal from TMRx's event generator output (where x = 0 or 2).
     * |        |          |0 = The event counting source is from external event pin.
     * |        |          |1 = The event counting source is from TMRx's event generator output.
     * |        |          |Note: This bit is only available in TMRx+1 (where x = 0 or 2).
     * |[12]    |EVNT_GEN_SRC|Event Generator Reference Input Source Selection
     * |        |          |This bit defines the event generator function controlled by external event pin or internal event signals from ACMP0.
     * |        |          |0 = The event generator reference source is from external event pin.
     * |        |          |1 = The event generator reference source is from ACMP0.
     * |        |          |Note: This bit is only available in TMRx (where x = 0 or 2).
     * |[16]    |CAP_SRC   |Capture Function Source Selection
     * |        |          |This bit defines timer counter reset function or timer capture function controlled by transition of TC pin or transition of internal signals from other functional blocks of this chip.
     * |        |          |0 = Transition of TC pin selected.
     * |        |          |1 = Transition of internal signals from ACMP0.
     * |        |          |Note: When this bit is high, the EVNT_DEB_EN (TMRx_CTL[14]) would not take effect.
     * |[31:24] |EVNT_DROP_CNT|Event Drop Count
     * |        |          |This field indicates timer to drop how many events after inter-timer trigger function enable.
     * |        |          |For example, if user writes 0x7 to this field, timer would drop 7 first incoming events and starts the inter-timer trigger operation when it get 8th event.
     * |        |          |This field would affect timer's operation only when inter-timer trigger function enabled (INTR_TRG_EN (TMRx_CTL[24]) = 1) and ITNR_TRG_MODE (TMRx_CTL[25]) = 1.
    */
    __IO uint32_t ECTL;

